{
  "nodes": [
    {
      "op": "null", 
      "name": "input_1:0", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "reshape_nop", 
      "attrs": {
        "num_inputs": "1", 
        "num_outputs": "1", 
        "hash": "c7865f44f2b0b41b", 
        "flatten_data": "0", 
        "func_name": "__nop"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_dense_pack", 
      "attrs": {
        "num_outputs": "1", 
        "hash": "c2c787c105209bbe", 
        "func_name": "tvmgen_default_fused_nn_contrib_dense_pack", 
        "weight_layout": "NC5n", 
        "flatten_data": "0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_exp_subtract_nn_relu_multiply_nn_relu_add_multiply_add_reshape", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "d284d46868f4aacd", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_reshape_add_exp_subtract_nn_relu_multiply_nn_relu_add_multiply_add_reshape"
      }, 
      "inputs": [
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_dense_pack_1", 
      "attrs": {
        "num_outputs": "1", 
        "hash": "d2b7766bcdccc1ec", 
        "func_name": "tvmgen_default_fused_nn_contrib_dense_pack_1", 
        "weight_layout": "NC5n", 
        "flatten_data": "0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_exp_subtract_nn_relu_multiply_nn_relu_add_multiply_add_reshape1", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "d284d46868f4aacd", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_reshape_add_exp_subtract_nn_relu_multiply_nn_relu_add_multiply_add_reshape"
      }, 
      "inputs": [
        [
          9, 
          0, 
          0
        ], 
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_dense_pack_11", 
      "attrs": {
        "num_outputs": "1", 
        "hash": "d2b7766bcdccc1ec", 
        "func_name": "tvmgen_default_fused_nn_contrib_dense_pack_1", 
        "weight_layout": "NC5n", 
        "flatten_data": "0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          13, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_exp_subtract_nn_relu_multiply_nn_relu_add_multiply_add_reshape2", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "d284d46868f4aacd", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_reshape_add_exp_subtract_nn_relu_multiply_nn_relu_add_multiply_add_reshape"
      }, 
      "inputs": [
        [
          15, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ], 
        [
          18, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_dense_pack_12", 
      "attrs": {
        "num_outputs": "1", 
        "hash": "d2b7766bcdccc1ec", 
        "func_name": "tvmgen_default_fused_nn_contrib_dense_pack_1", 
        "weight_layout": "NC5n", 
        "flatten_data": "0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_exp_subtract_nn_relu_multiply_nn_relu_add_multiply_add_reshape3", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "d284d46868f4aacd", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_reshape_add_exp_subtract_nn_relu_multiply_nn_relu_add_multiply_add_reshape"
      }, 
      "inputs": [
        [
          21, 
          0, 
          0
        ], 
        [
          22, 
          0, 
          0
        ], 
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_dense_pack_13", 
      "attrs": {
        "num_outputs": "1", 
        "hash": "d2b7766bcdccc1ec", 
        "func_name": "tvmgen_default_fused_nn_contrib_dense_pack_1", 
        "weight_layout": "NC5n", 
        "flatten_data": "0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add_exp_subtract_nn_relu_multiply_nn_relu_add_multiply_add_reshape4", 
      "attrs": {
        "num_inputs": "4", 
        "num_outputs": "1", 
        "hash": "d284d46868f4aacd", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_reshape_add_exp_subtract_nn_relu_multiply_nn_relu_add_multiply_add_reshape"
      }, 
      "inputs": [
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_dense_pack_2", 
      "attrs": {
        "num_outputs": "1", 
        "hash": "cb8881568dd15cf5", 
        "func_name": "tvmgen_default_fused_nn_contrib_dense_pack_2", 
        "weight_layout": "NC8n", 
        "flatten_data": "0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_reshape_add", 
      "attrs": {
        "num_inputs": "2", 
        "num_outputs": "1", 
        "hash": "20b2b01a46e07d77", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_reshape_add"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ], 
        [
          34, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    4, 
    5, 
    6, 
    8, 
    10, 
    11, 
    12, 
    14, 
    16, 
    17, 
    18, 
    20, 
    22, 
    23, 
    24, 
    26, 
    28, 
    29, 
    30, 
    32, 
    34
  ], 
  "heads": [
    [
      35, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "device_index": [
      "list_int", 
      [
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 1, 2], 
        [1, 2], 
        [4, 2, 5], 
        [1, 20], 
        [20], 
        [20], 
        [20], 
        [1, 20], 
        [4, 20, 5], 
        [1, 20], 
        [20], 
        [20], 
        [20], 
        [1, 20], 
        [4, 20, 5], 
        [1, 20], 
        [20], 
        [20], 
        [20], 
        [1, 20], 
        [4, 20, 5], 
        [1, 20], 
        [20], 
        [20], 
        [20], 
        [1, 20], 
        [4, 20, 5], 
        [1, 20], 
        [20], 
        [20], 
        [20], 
        [1, 20], 
        [1, 20, 8], 
        [1, 8], 
        [8], 
        [1, 1, 8]
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        0, 
        1, 
        2, 
        3, 
        4, 
        5, 
        6, 
        7, 
        2, 
        8, 
        9, 
        10, 
        6, 
        11, 
        2, 
        12, 
        13, 
        14, 
        6, 
        15, 
        2, 
        16, 
        17, 
        18, 
        6, 
        19, 
        2, 
        20, 
        21, 
        22, 
        6, 
        23, 
        2, 
        24, 
        6
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36
  ]
}