{
  "nodes": [
    {
      "op": "null", 
      "name": "input.1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_dense_pack_add", 
      "attrs": {
        "num_outputs": "1", 
        "hash": "54e3ae5533b2050e", 
        "func_name": "tvmgen_default_fused_nn_contrib_dense_pack_add", 
        "weight_layout": "NC4n", 
        "flatten_data": "0", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_dense_pack_add_1", 
      "attrs": {
        "num_outputs": "1", 
        "hash": "414bc6b1b1dfc80e", 
        "func_name": "tvmgen_default_fused_nn_contrib_dense_pack_add_1", 
        "weight_layout": "NC2n", 
        "flatten_data": "0", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_dense_pack_add_sigmoid", 
      "attrs": {
        "num_outputs": "1", 
        "hash": "c28b723c2211b166", 
        "func_name": "tvmgen_default_fused_nn_contrib_dense_pack_add_sigmoid", 
        "weight_layout": "NC1n", 
        "flatten_data": "0", 
        "num_inputs": "3"
      }, 
      "inputs": [
        [
          6, 
          0, 
          0
        ], 
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [0, 1, 2, 4, 5, 7, 8], 
  "heads": [
    [
      9, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "device_index": [
      "list_int", 
      [1, 1, 1, 1, 1, 1, 1, 1, 1, 1]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 8], 
        [1, 8, 4], 
        [1, 4], 
        [1, 4], 
        [1, 4, 2], 
        [1, 2], 
        [1, 2], 
        [1, 2, 1], 
        [1], 
        [1, 1]
      ]
    ], 
    "storage_id": [
      "list_int", 
      [0, 1, 2, 3, 4, 5, 6, 7, 8, 3]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10
  ]
}